app/documentation/k6_Grafana/k6_test_results.txt
Test_1 - мгновенная нагрузка с фиксированным числом пользователей
Отправляет POST-запрос каждые 1 секунду от 10 "виртуальных пользователей".
Проверяет, что статус ответа = 200.
Длительность теста — 20 секунд.


Результат

TOTAL RESULTS

    checks_total.......: 190    9.451698/s
    checks_succeeded...: 95.26% 181 out of 190
    checks_failed......: 4.73%  9 out of 190

    ✗ status is 200
      ↳  95% — ✓ 181 / ✗ 9

    HTTP
    http_req_duration..............: avg=51.7ms  min=8.35ms med=28.88ms max=448.57ms p(90)=51.13ms p(95)=287.88ms
      { expected_response:true }...: avg=32.06ms min=8.35ms med=27.78ms max=420.56ms p(90)=46.98ms p(95)=51.18ms
    http_req_failed................: 4.73%  9 out of 190
    http_reqs......................: 190    9.451698/s

    EXECUTION
    iteration_duration.............: avg=1.05s   min=1.01s  med=1.03s   max=1.47s    p(90)=1.05s   p(95)=1.29s
    iterations.....................: 190    9.451698/s
    vus............................: 10     min=10       max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 140 kB 7.0 kB/s
    data_sent......................: 111 kB 5.5 kB/s


Расшифровка

1. Общая картина
checks_succeeded...: 95.26%  (181 из 190)
checks_failed......: 4.73%   (9 из 190)

181 запрос из 190 вернулся со статусом 200, 9 запросов завершились с ошибкой.

Посмотрев Н2 БД, увидела что первые запросы под id 1-2, 3-10 (суммарно 9) не записались в таблицу agreements.
Причины:
Когда ты запускаешь свой сервис, он вроде бы уже «запущен» (порт открыт, эндпоинты доступны), но на самом деле:
1) JIT-компиляция (Just-In-Time) JVM ещё не прогрета — код выполняется в интерпретаторе, пока JIT не оптимизирует часто вызываемые методы.
→ первые десятки запросов работают медленнее.
2) Spring Context и Bean-инициализация уже завершены, но:
- при первом вызове сервисов может происходить ленивая инициализация зависимостей (например, EntityManager, коннекты к БД, конверторы и логгеры);
- создаются Hibernate сессии и подготавливаются SQL-запросы;
- JDBC-пул (например, HikariCP) создаёт соединения не сразу, а по мере поступления запросов.
3) Если ты используешь Liquibase или Flyway, они тоже могут заблокировать БД на миграции при запуске (что иногда ловит первые запросы).
4) Кэш (в том числе внутри Hibernate) тоже пуст — на первых вызовах ORM прогружает метаданные, типы, SQL-шаблоны и т.д.

📊 Почему это проявляется в k6

Ты запустила сразу 10 виртуальных пользователей, и они одновременно отправили первые POST-запросы.
Пока приложение «просыпается» (JIT + JDBC-пул), часть запросов получает timeout или 500/415,
остальные, чуть позже отправленные, проходят нормально.

Это и объясняет:
95.26% успешных ответов, 4.73% failed (9 из 190)
и то, что в БД отсутствуют первые записи — они просто не дошли.

Как устранить:
1) Warm-up перед тестом
Добавь короткую стадию, где нагрузка растёт плавно, например:

stages: [
  { duration: '10s', target: 1 },   // прогрев
  { duration: '10s', target: 10 },  // основная нагрузка
]

Это даст время JIT и Hibernate разогреться.

2) Проверка readiness
Перед началом теста можно вызвать /actuator/health или /actuator/ready
— убедиться, что приложение реально готово принимать запросы.

3) Предварительно прогреть вручную
Сделай один POST-запрос через Postman или curl, подожди 1–2 секунды, потом запускай k6.

4) Увеличить пул соединений в HikariCP
Иногда первые запросы теряются, потому что пул создаёт соединения «по требованию».
Можно задать, например:

spring.datasource.hikari.minimum-idle=5
spring.datasource.hikari.maximum-pool-size=10

Тогда пул будет готов к первым вызовам.

2. Скорость ответа
http_req_duration: avg=51.7ms  min=8.35ms  max=448.57ms

Это средняя продолжительность запроса — отличная метрика!

💨 Среднее время = ~52 мс — очень быстро ✅
🧊 Даже пиковое (max) = ~448 мс — всё ещё комфортно.

Для API до 500 мс — считается хорошим результатом.

3. Общее количество запросов
http_reqs: 190  (9.45/s)

Значит, за 20 секунд k6 сделал 190 POST-запросов (≈9 запросов в секунду).
Это соответствует твоим настройкам (10 VU + sleep(1)).

4. Что это значит на практике

Приложение стабильно выдерживает 10 параллельных пользователей.
Но иногда проскакивают ошибки (примерно 1 из 20 запросов).


Test_2 - постепенная нагрузка с увеличением числа пользователей до 100

Отправляет POST-запрос каждые 1 секунду

export const options = {
  stages: [
    { duration: '10s', target: 10 },  // 10 пользователей за 10 секунд
    { duration: '20s', target: 50 },  // увеличиваем до 50
    { duration: '30s', target: 100 }, // пик — 100 одновременных
    { duration: '20s', target: 0 },   // спад нагрузки
  ],
  thresholds: {
    http_req_duration: ['p(95)<300'], // 95% запросов должны быть быстрее 300мс
    http_req_failed: ['rate<0.05'],   // не более 5% ошибок
  },
};

Проверяет, что статус ответа = 200.
Длительность теста — 1 минута 20 секунд.

Результат

THRESHOLDS

    http_req_duration
    ✓ 'p(95)<300' p(95)=13.56ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 7810    96.802015/s
    checks_succeeded...: 100.00% 7810 out of 7810
    checks_failed......: 0.00%   0 out of 7810

    ✓ status is 200
    ✓ response has agreementPremium

    HTTP
    http_req_duration..............: avg=7.23ms min=1.48ms med=6.16ms max=93.32ms p(90)=11.22ms p(95)=13.56ms
      { expected_response:true }...: avg=7.23ms min=1.48ms med=6.16ms max=93.32ms p(90)=11.22ms p(95)=13.56ms
    http_req_failed................: 0.00%  0 out of 3905
    http_reqs......................: 3905   48.401007/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s     med=1s     max=1.09s   p(90)=1.01s   p(95)=1.01s
    iterations.....................: 3905   48.401007/s
    vus............................: 4      min=1         max=99
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 3.0 MB 37 kB/s
    data_sent......................: 2.3 MB 28 kB/s

Расшифровка

1) все запросы успешно отработали,
2) ни одного падения,
3) 95% запросов укладываются в 13 мс 

Можно сделать три важных вывода:
1. Приложение стабильно
2. После прогрева оно держит нагрузку идеально. Это подтверждает, что первые сбои в предыдущем тесте 
действительно были вызваны «холодным стартом» JVM/контекста.

Test_3 - постепенная нагрузка с увеличением числа пользователей до 200

Отправляет POST-запрос каждые 1 секунду

export const options = {
  stages: [
    { duration: '10s', target: 10 }, // 10 пользователей за 10 секунд
    { duration: '10s', target: 50 }, // увеличиваем до 50
    { duration: '10s', target: 100 }, // увеличиваем до 100
    { duration: '10s', target: 200 }, // пик 200
    { duration: '10s', target: 0 }, // спуск
  ],
  thresholds: {
    http_req_failed: ['rate<0.05'],
    http_req_duration: ['p(95)<300'],
  },
};

Проверяет, что статус ответа = 200.
Длительность теста — 50 секунд

Результат

 THRESHOLDS

    http_req_duration
    ✓ 'p(95)<300' p(95)=8.29ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 7346    144.888876/s
    checks_succeeded...: 100.00% 7346 out of 7346
    checks_failed......: 0.00%   0 out of 7346

    ✓ status is 200
    ✓ response has agreementPremium

    HTTP
    http_req_duration..............: avg=3.42ms min=0s med=2.6ms max=23.7ms p(90)=6.84ms p(95)=8.29ms
      { expected_response:true }...: avg=3.42ms min=0s med=2.6ms max=23.7ms p(90)=6.84ms p(95)=8.29ms
    http_req_failed................: 0.00%  0 out of 3673
    http_reqs......................: 3673   72.444438/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s med=1s    max=1.02s  p(90)=1s     p(95)=1s
    iterations.....................: 3673   72.444438/s
    vus............................: 10     min=1         max=199
    vus_max........................: 200    min=200       max=200

    NETWORK
    data_received..................: 2.8 MB 55 kB/s
    data_sent......................: 2.1 MB 42 kB/s

Расшифровка

Тест прошел идеально

Test_4 - постепенная нагрузка с увеличением числа пользователей до 1000

Отправляет POST-запрос каждые 1 секунду

export const options = {
  stages: [
    { duration: '10s', target: 100 },   // разгон
    { duration: '10s', target: 300 },
    { duration: '10s', target: 600 },
    { duration: '10s', target: 1000 },  // пик
    { duration: '20s', target: 1000 },  // держим нагрузку
    { duration: '10s', target: 0 },     // спуск
  ],
  thresholds: {
    http_req_failed: ['rate<0.05'],      // <5% ошибок
    http_req_duration: ['p(95)<500'],    // 95% запросов < 500мс
  },
};

Проверяет, что статус ответа = 200.
Длительность теста — 1 минута 10 секунд

Результат

  █ THRESHOLDS

    http_req_duration
    ✗ 'p(95)<500' p(95)=541.88ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 299280  4264.481811/s
    checks_succeeded...: 100.00% 299280 out of 299280
    checks_failed......: 0.00%   0 out of 299280

    ✓ status is 200
    ✓ response has agreementPremium

    HTTP
    http_req_duration..............: avg=267.92ms min=618.19µs med=281.73ms max=1.18s p(90)=474.35ms p(95)=541.88ms
      { expected_response:true }...: avg=267.92ms min=618.19µs med=281.73ms max=1.18s p(90)=474.35ms p(95)=541.88ms
    http_req_failed................: 0.00%  0 out of 149640
    http_reqs......................: 149640 2132.240906/s

    EXECUTION
    iteration_duration.............: avg=268.05ms min=737.4µs  med=281.78ms max=1.18s p(90)=474.43ms p(95)=542.05ms
    iterations.....................: 149640 2132.240906/s
    vus............................: 8      min=8           max=1000
    vus_max........................: 1000   min=1000        max=1000

    NETWORK
    data_received..................: 114 MB 1.6 MB/s
    data_sent......................: 87 MB  1.2 MB/s


running (1m10.2s), 0000/1000 VUs, 149640 complete and 0 interrupted iterations
default ✓ [======================================] 0000/1000 VUs  1m10s
ERRO[0070] thresholds on metrics 'http_req_duration' have been crossed

Расшифровка

Показатель	Значение	             Что значит
p(95)=541.88ms	❌ чуть выше 500 мс	     95 % запросов успевают обработаться быстрее чем за ~0.54 с
rate<0.05	✅ 0 % ошибок	             сервис не упал, вообще ни одного 5xx/4xx
avg=267 ms	👍 среднее время ответа	     очень прилично для 1000 одновременных пользователей
max=1.18 s	⚠️ небольшие пики	     при пике нагрузки кто-то ждал чуть дольше секунды


✅ Сервис устойчивый.
Он выдерживает 1000 одновременных запросов без ошибок.

⚠️ Лёгкое падение производительности.
Задержка > 500 мс у верхних 5 % запросов говорит о том, что:

1) пул соединений к БД работает на пределе (можно проверить spring.datasource.hikari.maximum-pool-size);
2) CPU или GC начинают работать активнее;
3) возможно, HTTP-потоки (Tomcat Jetty) приближаются к лимиту maxThreads.

💡 Это абсолютно нормальное поведение на таком уровне нагрузки. Для 1k пользователей — результат отличный.